In [1]:
import pandas as pd
df = pd.read_csv('c:/users/rakesh/Desktop/Notes/PandasCode/student.csv')
print(df)

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56

Accessing Column(s) of DataFrame

In [2]:
#accessing a single column from the dataframe 
df['name']

0    rakesh
1      amit
2        jm
3     vikas
4        rk
5     dhruv
Name: name, dtype: object

In [3]:
#accessing multiple columns- using list of names
df[['name','english']]

     name  english
0  rakesh       45
1    amit       56
2      jm       45
3   vikas       34
4      rk       67
5   dhruv       78

In [4]:
#accessing rows /column using  iloc() method 
df.iloc[:,[1,3,4]]

   english  cs  physics
0       45  56       56
1       56  56       67
2       45  89       67
3       34  89       78
4       67  67       67
5       78  90       56

Adding a New Column in existing DataFrame

In [5]:
df

     name  english  math  cs  physics  chemistry
0  rakesh       45    87  56       56         78
1    amit       56    89  56       67         87
2      jm       45    45  89       67         66
3   vikas       34    67  89       78         67
4      rk       67    89  67       67         45
5   dhruv       78    67  90       56         56

In [6]:
#add a new column
df['Eco'] =100   #single value add same value for all the rows
df

     name  english  math  cs  physics  chemistry  Eco
0  rakesh       45    87  56       56         78  100
1    amit       56    89  56       67         87  100
2      jm       45    45  89       67         66  100
3   vikas       34    67  89       78         67  100
4      rk       67    89  67       67         45  100
5   dhruv       78    67  90       56         56  100

In [7]:
# add a new value for each row
df['bs'] =[78,56,67,78,98,67]  #here value must be equal to row count
df

     name  english  math  cs  physics  chemistry  Eco  bs
0  rakesh       45    87  56       56         78  100  78
1    amit       56    89  56       67         87  100  56
2      jm       45    45  89       67         66  100  67
3   vikas       34    67  89       78         67  100  78
4      rk       67    89  67       67         45  100  98
5   dhruv       78    67  90       56         56  100  67

In [8]:
#add a column from the dataFrame column
df['acc'] = df['bs']
df

     name  english  math  cs  physics  chemistry  Eco  bs  acc
0  rakesh       45    87  56       56         78  100  78   78
1    amit       56    89  56       67         87  100  56   56
2      jm       45    45  89       67         66  100  67   67
3   vikas       34    67  89       78         67  100  78   78
4      rk       67    89  67       67         45  100  98   98
5   dhruv       78    67  90       56         56  100  67   67

In [9]:
#ADD A column from the calculation of existing columns
df['total'] = df['english'] + df['math']
df

     name  english  math  cs  physics  chemistry  Eco  bs  acc  total
0  rakesh       45    87  56       56         78  100  78   78    132
1    amit       56    89  56       67         87  100  56   56    145
2      jm       45    45  89       67         66  100  67   67     90
3   vikas       34    67  89       78         67  100  78   78    101
4      rk       67    89  67       67         45  100  98   98    156
5   dhruv       78    67  90       56         56  100  67   67    145

In [10]:
df['bs']=200  # if column already exists then it update that column
df

     name  english  math  cs  physics  chemistry  Eco   bs  acc  total
0  rakesh       45    87  56       56         78  100  200   78    132
1    amit       56    89  56       67         87  100  200   56    145
2      jm       45    45  89       67         66  100  200   67     90
3   vikas       34    67  89       78         67  100  200   78    101
4      rk       67    89  67       67         45  100  200   98    156
5   dhruv       78    67  90       56         56  100  200   67    145

Rename DataFrame Column using- rename() method

In [ ]:
df

In [11]:
#changing all the column names of a DataFrame
df.columns = ['Name', 'Eng', 'Maths', 'CompSc', 'Phy', 'Chem']
df

ValueError: Length mismatch: Expected axis has 10 elements, new values have 6 elements

In [16]:
df.rename(columns={'english':'Eng'},inplace=True) #changes will not be reflected in same dataFrame
print(df)

df1= df.rename(columns={'physics':'phy'})
print(df1)

     name  Eng  math  cs  physics  chemistry  Eco   bs  acc  total
0  rakesh   45    87  56       56         78  100  200   78    132
1    amit   56    89  56       67         87  100  200   56    145
2      jm   45    45  89       67         66  100  200   67     90
3   vikas   34    67  89       78         67  100  200   78    101
4      rk   67    89  67       67         45  100  200   98    156
5   dhruv   78    67  90       56         56  100  200   67    145
     name  Eng  math  cs  phy  chemistry  Eco   bs  acc  total
0  rakesh   45    87  56   56         78  100  200   78    132
1    amit   56    89  56   67         87  100  200   56    145
2      jm   45    45  89   67         66  100  200   67     90
3   vikas   34    67  89   78         67  100  200   78    101
4      rk   67    89  67   67         45  100  200   98    156
5   dhruv   78    67  90   56         56  100  200   67    145

In [18]:
df.rename(columns ={'Eng':'Eng Core'},inplace=True)
df

     name  Eng Core  math  cs  physics  chemistry  Eco   bs  acc  total
0  rakesh        45    87  56       56         78  100  200   78    132
1    amit        56    89  56       67         87  100  200   56    145
2      jm        45    45  89       67         66  100  200   67     90
3   vikas        34    67  89       78         67  100  200   78    101
4      rk        67    89  67       67         45  100  200   98    156
5   dhruv        78    67  90       56         56  100  200   67    145

In [19]:
#rename multiple columns in a single command
df.rename(columns ={'math':'maths','chemistry':'chem'},inplace = True)
df

     name  Eng Core  maths  cs  physics  chem  Eco   bs  acc  total
0  rakesh        45     87  56       56    78  100  200   78    132
1    amit        56     89  56       67    87  100  200   56    145
2      jm        45     45  89       67    66  100  200   67     90
3   vikas        34     67  89       78    67  100  200   78    101
4      rk        67     89  67       67    45  100  200   98    156
5   dhruv        78     67  90       56    56  100  200   67    145

In [20]:
# Renaming Multiple columns.  --silently
df.rename({'Name': 'student name', 'cs': 'IP',
          'physics': 'Phy'}, axis="columns", inplace=True)
df

     name  Eng Core  maths  IP  Phy  chem  Eco   bs  acc  total
0  rakesh        45     87  56   56    78  100  200   78    132
1    amit        56     89  56   67    87  100  200   56    145
2      jm        45     45  89   67    66  100  200   67     90
3   vikas        34     67  89   78    67  100  200   78    101
4      rk        67     89  67   67    45  100  200   98    156
5   dhruv        78     67  90   56    56  100  200   67    145

In [21]:
# change column name silently and does not display it directly
df.columns.values[0] = 'course'
df

   course  Eng Core  maths  IP  Phy  chem  Eco   bs  acc  total
0  rakesh        45     87  56   56    78  100  200   78    132
1    amit        56     89  56   67    87  100  200   56    145
2      jm        45     45  89   67    66  100  200   67     90
3   vikas        34     67  89   78    67  100  200   78    101
4      rk        67     89  67   67    45  100  200   98    156
5   dhruv        78     67  90   56    56  100  200   67    145

Delete DataFrame Columns using - drop(), pop() methods

In [22]:
df

   course  Eng Core  maths  IP  Phy  chem  Eco   bs  acc  total
0  rakesh        45     87  56   56    78  100  200   78    132
1    amit        56     89  56   67    87  100  200   56    145
2      jm        45     45  89   67    66  100  200   67     90
3   vikas        34     67  89   78    67  100  200   78    101
4      rk        67     89  67   67    45  100  200   98    156
5   dhruv        78     67  90   56    56  100  200   67    145

In [25]:
#remove single column from the dataframe
df1= df.drop(['maths'],axis=1)
df1

   course  Eng Core  IP  Phy  chem  Eco   bs  acc  total
0     NaN        45  56   56    78  100  200   78    132
1     NaN        56  56   67    87  100  200   56    145
2     NaN        45  89   67    66  100  200   67     90
3     NaN        34  89   78    67  100  200   78    101
4     NaN        67  67   67    45  100  200   98    156
5     NaN        78  90   56    56  100  200   67    145

In [26]:
df

   course  Eng Core  maths  IP  Phy  chem  Eco   bs  acc  total
0  rakesh        45     87  56   56    78  100  200   78    132
1    amit        56     89  56   67    87  100  200   56    145
2      jm        45     45  89   67    66  100  200   67     90
3   vikas        34     67  89   78    67  100  200   78    101
4      rk        67     89  67   67    45  100  200   98    156
5   dhruv        78     67  90   56    56  100  200   67    145

In [29]:
#remove multiple columns from the dataframe
df.drop(['course','lP'],axis=1)
df

KeyError: "['course', 'ip'] not found in axis"

In [ ]:
#another method to remove columns from the database
df.drop(columns =['english','math'])

In [ ]:
#delete columns using column index
df.drop(df.columns[[1,2,4]],inplace=True,axis=1)
df

In [ ]:
#using from and iloc() method 
df.drop(df.iloc[:,[1,3]],inplace=True,axis=1)
df

drop column using del function and pop() method

In [ ]:
df

In [ ]:
del df['english']  #takes only one column name as its argument
df

In [ ]:
df.pop('math') #only one column is allowed at a time to remove from the dataFrame
df